# ThermalMass Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThermalProperties..::..ThermalMass Property
ThermalProperties Class See Also
---
The calculated thermal mass value. The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double ThermalMass { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ThermalMass As Double
	Get
```

Visual C++
---
```text
public:
property double ThermalMass {
	double get ();
}
```

# See Also
ThermalProperties Class
Autodesk.Revit.DB Namespace